app/Http/Controllers/CategoryController.php

select * from `categories`
---
    public function create()
    {
        return view('category.create', [
            'categories' => Category::all(),
        ]);

insert into `categories` (`name`, `parent_id`) values ('Posts', null)
---
    public function store(CategoryRequest $request )
    {
        //todo validate, get id from category name
        $categories = DB::select('select * from categories');
        $data = $request->validated();
        $category = new Category();
        $category->name = $data['category'];
        $category->parent_id = $data['parent_category'];
        $category->save();