app/Http/Controllers/PostController.php

select * from `posts` order by `created_at` desc limit 6 offset 0
select count(*) as aggregate from `posts`
---
    public function index()
    {
        $posts = Post::latest()->paginate(6);

select * from `categories`
---
    public function create()
    {
        return view('post.create', [
            'categories' => Category::all(),
        ]);

insert into `posts` (`name`, `author_id`, `short_description`, `description`, `img_link`, `comment_enabled`, `updated_at`, `created_at`) values ('Тупая ворона', 1, 'Описание тупой вороны', 'Егор какого хера 20 символов', 'images/1744893696.jpg', 0, '2025-04-17 12:41:36', '2025-04-17 12:41:36')
insert into `posts_categories` (`post_id`, `category_id`) values (1, '1')
---
    public function store(StoreFormRequest $request)
    {
        $data = $request->validated();
        $image = $data['file'];
        $imageName = time() . '.' . $image->getClientOriginalExtension();
        $imagePath = $image->StoreAs('/images', $imageName ,'public');
        $post = new Post();
        $post->name = $data['title'];
        $post->author_id = Auth::id();
        $post->short_description = $data['short_description'];
        $post->description = $data['description'];
        $post->img_link = $imagePath;
        if (!isset($data['comments'])) {
            $post->comment_enabled = 0;
        }
        $post->save();
        $this->savePostsCategories($data['categories'], $post->id);